In [1]:
#Loading packages

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import datetime as dt

In [4]:
#Loading datasets

commission_data = pd.read_csv("commission_data.csv")
transactions_data =  pd.read_csv("transactions_data.csv")
user_infor = pd.read_csv("user_infor.csv")

In [78]:
#Get an overview of the data

commission_data.head()

  Merchant_name  Merchant_id  Rate_pct
0       Viettel         22.0       2.0
1      Mobifone         33.0       3.0
2     Vinaphone         44.0       4.0
3  Vietnamobile         55.0       4.0
4       Gmobile         66.0       4.0

In [7]:
transactions_data.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Partner_id
0,21269588.0,4.169518e+09,2020-01-01,"10,000",33.0,NaN,NaN
1,28097592.0,4.170277e+09,2020-01-01,"20,000",33.0,NaN,NaN
2,47435144.0,4.166729e+09,2020-01-01,"10,000",22.0,NaN,NaN
3,29080935.0,4.174460e+09,2020-01-01,"10,000",33.0,NaN,NaN
4,14591075.0,4.168217e+09,2020-01-01,"10,000",22.0,NaN,NaN

In [8]:
user_infor.head()

    User_id First_tran_date      Location  Age Gender
0   3891001      2019-11-15   Hồ Chí Minh  >37   MALE
1  52571990      2020-01-14   Hồ Chí Minh  >37   MALE
2    366389      2018-09-21  Other Cities  >37   MALE
3  51104816      2020-04-13  Other Cities  >37   MALE
4   7710245      2018-12-21  Other Cities  >37   MALE

In [11]:
commission_data.dtypes

Merchant_name     object
Merchant_id      float64
Rate_pct         float64
dtype: object

In [12]:
transactions_data.dtypes

user_id            float64
order_id           float64
Date                object
Amount              object
Merchant_id        float64
Purchase_status     object
Partner_id         float64
dtype: object

In [13]:
user_infor.dtypes

User_id             int64
First_tran_date    object
Location           object
Age                object
Gender             object
dtype: object

In [14]:
commission_data.shape

(999, 3)

In [15]:
transactions_data.shape

(13496, 7)

In [16]:
user_infor.shape

(13428, 5)

In [19]:
#Check null and duplicated values and remove it

commission_data.isnull().sum()

Merchant_name    994
Merchant_id      994
Rate_pct         994
dtype: int64

In [20]:
transactions_data.isnull().sum()

user_id                1
order_id               1
Date                   1
Amount                 1
Merchant_id            1
Purchase_status    11261
Partner_id         11261
dtype: int64

In [21]:
user_infor.isnull().sum()

User_id            0
First_tran_date    0
Location           0
Age                0
Gender             0
dtype: int64

In [22]:
commission_data.duplicated().sum()

993

In [34]:
commission_data.drop_duplicates(inplace=True)

In [36]:
commission_data.dropna(inplace=True)

In [39]:
commission_data.head()

  Merchant_name  Merchant_id  Rate_pct
0       Viettel         22.0       2.0
1      Mobifone         33.0       3.0
2     Vinaphone         44.0       4.0
3  Vietnamobile         55.0       4.0
4       Gmobile         66.0       4.0

In [40]:
transactions_data.duplicated().sum()

0

In [41]:
user_infor.duplicated().sum()

0

In [43]:
#changing to datetype in transactions data and user infor

transactions_data['Date'] = pd.to_datetime(transactions_data['Date'])

In [51]:
user_infor = user_infor.rename(columns={'First_tran_date':'Date'})

In [52]:
user_infor['Date'] = pd.to_datetime(user_infor['Date'])

In [77]:
#Make more columns to make data visualization easier later.

In [54]:
transactions_data['DayOfWeek'] = transactions_data['Date'].dt.day_name()

In [55]:
user_infor['DayOfWeek'] = user_infor['Date'].dt.day_name()

In [65]:
transactions_data['Year'] = transactions_data['Date'].dt.year

In [66]:
transactions_data['Month'] = transactions_data['Date'].dt.month

In [67]:
user_infor['Year'] = user_infor['Date'].dt.year

In [68]:
user_infor['Month'] = user_infor['Date'].dt.month

In [69]:
transactions_data['Quarter'] = transactions_data['Date'].dt.to_period('Q')

In [72]:
user_infor['Quarter'] = user_infor['Date'].dt.to_period('Q')

In [91]:
transactions_data = transactions_data.fillna(0)

transactions_data['user_id'] = transactions_data['user_id'].astype('int')

In [74]:
commission_data.head()

  Merchant_name  Merchant_id  Rate_pct
0       Viettel         22.0       2.0
1      Mobifone         33.0       3.0
2     Vinaphone         44.0       4.0
3  Vietnamobile         55.0       4.0
4       Gmobile         66.0       4.0

In [75]:
transactions_data.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Partner_id,DayOfWeek,Year,Month,Quarter
0,21269588.0,4.169518e+09,2020-01-01,"10,000",33.0,NaN,NaN,Wednesday,2020.0,1.0,2020Q1
1,28097592.0,4.170277e+09,2020-01-01,"20,000",33.0,NaN,NaN,Wednesday,2020.0,1.0,2020Q1
2,47435144.0,4.166729e+09,2020-01-01,"10,000",22.0,NaN,NaN,Wednesday,2020.0,1.0,2020Q1
3,29080935.0,4.174460e+09,2020-01-01,"10,000",33.0,NaN,NaN,Wednesday,2020.0,1.0,2020Q1
4,14591075.0,4.168217e+09,2020-01-01,"10,000",22.0,NaN,NaN,Wednesday,2020.0,1.0,2020Q1

In [76]:
user_infor.head()

,User_id,Date,Location,Age,Gender,DayOfWeek,Year,Month,Quarter
0,3891001,2019-11-15,Hồ Chí Minh,>37,MALE,Friday,2019,11,2019Q4
1,52571990,2020-01-14,Hồ Chí Minh,>37,MALE,Tuesday,2020,1,2020Q1
2,366389,2018-09-21,Other Cities,>37,MALE,Friday,2018,9,2018Q3
3,51104816,2020-04-13,Other Cities,>37,MALE,Monday,2020,4,2020Q2
4,7710245,2018-12-21,Other Cities,>37,MALE,Friday,2018,12,2018Q4

In [99]:
merge_data = pd.merge(transactions_data, user_infor, left_on='user_id', right_on='User_id')

In [100]:
merge_data.head()

,user_id,order_id,Date_x,Amount,Merchant_id,Purchase_status,Partner_id,DayOfWeek_x,Year_x,Month_x,Quarter_x,User_id,Date_y,Location,Age,Gender,DayOfWeek_y,Year_y,Month_y,Quarter_y
0,21269588,4.169518e+09,2020-01-01 00:00:00,"10,000",33.0,0,0.0,Wednesday,2020.0,1.0,2020Q1,21269588,2018-12-11,Hà Nội,>37,FEMALE,Tuesday,2018,12,2018Q4
1,28097592,4.170277e+09,2020-01-01 00:00:00,"20,000",33.0,0,0.0,Wednesday,2020.0,1.0,2020Q1,28097592,2019-12-30,Hà Nội,>37,FEMALE,Monday,2019,12,2019Q4
2,47435144,4.166729e+09,2020-01-01 00:00:00,"10,000",22.0,0,0.0,Wednesday,2020.0,1.0,2020Q1,47435144,2019-11-11,Hà Nội,18_to_22,FEMALE,Monday,2019,11,2019Q4
3,29080935,4.174460e+09,2020-01-01 00:00:00,"10,000",33.0,0,0.0,Wednesday,2020.0,1.0,2020Q1,29080935,2019-10-24,Hà Nội,18_to_22,FEMALE,Thursday,2019,10,2019Q4
4,14591075,4.168217e+09,2020-01-01 00:00:00,"10,000",22.0,0,0.0,Wednesday,2020.0,1.0,2020Q1,14591075,2019-12-28,Other Cities,18_to_22,FEMALE,Saturday,2019,12,2019Q4

In [102]:
merge_data.shape

(13576, 20)

In [104]:
merge_data_fn = pd.merge(merge_data, commission_data, on='Merchant_id')

In [107]:
merge_data_fn.tail()

,user_id,order_id,Date_x,Amount,Merchant_id,Purchase_status,Partner_id,DayOfWeek_x,Year_x,Month_x,...,Date_y,Location,Age,Gender,DayOfWeek_y,Year_y,Month_y,Quarter_y,Merchant_name,Rate_pct
13571,1093979,8.721689e+09,2020-12-31 00:00:00,"50,000",44.0,0,0.0,Thursday,2020.0,12.0,...,2019-08-01,Other Cities,unknown,MALE,Thursday,2019,8,2019Q3,Vinaphone,4.0
13572,8309420,8.720961e+09,2020-12-31 00:00:00,"10,000",44.0,0,0.0,Thursday,2020.0,12.0,...,2020-01-31,Other Cities,unknown,FEMALE,Friday,2020,1,2020Q1,Vinaphone,4.0
13573,50343168,4.849822e+09,2020-02-21 00:00:00,"50,000",66.0,0,0.0,Friday,2020.0,2.0,...,2019-11-24,Hồ Chí Minh,23_to_27,MALE,Sunday,2019,11,2019Q4,Gmobile,4.0
13574,48271969,6.746001e+09,2020-08-19 00:00:00,"20,000",66.0,0,0.0,Wednesday,2020.0,8.0,...,2019-07-23,Other Cities,28_to_32,MALE,Tuesday,2019,7,2019Q3,Gmobile,4.0
13575,38572252,7.071489e+09,2020-09-12 00:00:00,"10,000",66.0,0,0.0,Saturday,2020.0,9.0,...,2017-04-17,Other Cities,23_to_27,MALE,Monday,2017,4,2017Q2,Gmobile,4.0

In [114]:
commission_data.to_csv('commission_df_cleaned.csv')

In [115]:
transactions_data.to_csv('transactions_df_cleaned.csv')

In [116]:
user_infor.to_csv('user_inf_cleaned.csv')

In [117]:
merge_data_fn.to_csv('merge_data_cleaned.csv')